brew "agent-browser"
brew "beads"
brew "btop"
brew "fish"
brew "mise"
brew "neovim"
brew "sops"
brew "tailscale", restart_service: :changed
brew "tmux"
brew "todoist-cli"
brew "unzip"
cask "battle-net"
cask "brave-browser"
cask "codex"
cask "codex-app"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "minecraft"
cask "rectangle"
cask "runelite"
cask "spotify"
cask "tailscale-app"
cask "todoist-app"
cask "visual-studio-code"
cask "zoom"
vscode "ahmadalli.vscode-nginx-conf"
vscode "bahramjoharshamshiri.hcl-lsp"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "dautroc.splitjoin-vscode"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "elixir-tools.elixir-tools"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "grantbachman.challenger-deep-theme"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "jinliming2.vscode-go-template"
vscode "kahole.magit"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ndonfris.fish-lsp"
vscode "phoenixframework.phoenix"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "upboundio.upbound"
vscode "vscodevim.vim"
